Дипломная_работа/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломная_работа/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная_работа/src/CommonModules/ВКМ_МассовоеСозданиеАктов/Module.bsl
#Область ПрограммныйИнтерфейс   
Функция ВыполнитьАвтозаполнение(ПараметрыЗапуска)Экспорт
	
	АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	ВыполненныеРаботы = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	//Если НЕ ЗначениеЗаполнено(АбонентскаяПлата)Тогда
	//	 Сообщение = Новый СообщениеПользователю;
	//	 Сообщение.Текст = "Необходимо заполнить значение константы Номенклатура абонентской платы";
	//	 Сообщение.Сообщить();   
	//	 Возврат;
	//КонецЕсли;	 
	//Если НЕ ЗначениеЗаполнено(ВыполненныеРаботы)Тогда
	//	 Сообщение = Новый СообщениеПользователю;
	//	 Сообщение.Текст = "Необходимо заполнить значение константы Номенклатура работы специалиста";
	//	 Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;	  
	//
	//ДокОбъект.Товары.Очистить();
	//ДокОбъект.Услуги.Очистить();
	//ДокОбъект.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор.Ссылка КАК ДоговорСсылка,
		|	РеализацияТоваровУслуг.Договор.ВКМ_СуммаЕжемесячнойПлаты КАК СуммаЕжемесячнойПлаты,
		|	РеализацияТоваровУслуг.Договор.ВКМ_СтоимостьЧаса КАК СтоимостьЧаса,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0) КАК КоличествоЧасов,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплате
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|		ПО РеализацияТоваровУслуг.Договор = ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка МЕЖДУ &ДатаНачала И &ДатаОкончания";     
	
//	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);  
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗапуска.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗапуска.ДатаОкончания);
	//Запрос.УстановитьПараметр("Договор", ДокОбъект.Ссылка.Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СуммаЕжемесячнойПлаты > 0 Тогда
			ДокРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокРеализации.Дата = ПараметрыЗапуска.ДатаОкончания;
			ДокРеализации.Договор = ВыборкаДетальныеЗаписи.ДоговорСсылка;
			
			НоваяСтрока = ДокРеализации.Услуги.Добавить();    
			НоваяСтрока.Номенклатура = АбонентскаяПлата;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаЕжемесячнойПлаты;    
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаЕжемесячнойПлаты; 
			ДокРеализации.Записать();
			
		КонецЕсли; 
		
		Если ВыборкаДетальныеЗаписи.СуммаКОплате > 0 Тогда
			
			ДокРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокРеализации.Дата = ПараметрыЗапуска.ДатаОкончания;
			ДокРеализации.Договор = ВыборкаДетальныеЗаписи.ДоговорСсылка;

			
			НоваяСтрока = ДокРеализации.Услуги.Добавить();    
			НоваяСтрока.Номенклатура = ВыполненныеРаботы;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасов;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате / ВыборкаДетальныеЗаписи.КоличествоЧасов;   
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплате; 
			ДокРеализации.Записать();  
			
		КонецЕсли;
		
	КонецЦикла;   
	
КонецФункции	



#КонецОбласти
